<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px">

## Lab: Cleaning Rock Song Data

_Authors: Dave Yerrington (SF)_

---

In [2]:
import pandas as pd
import numpy as np 
import seaborn as sns

%matplotlib inline

### 1. Load `rock.csv` and do an initial examination of its data columns.

In [3]:
rockfile = "./datasets/rock.csv"

In [4]:
# Load the data.
rock = pd.read_csv(rockfile)
rock

,Song Clean,ARTIST CLEAN,Release Year,COMBINED,First?,Year?,PlayCount,F*G
0,Caught Up in You,.38 Special,1982,Caught Up in You by .38 Special,1,1,82,82
1,Fantasy Girl,.38 Special,NaN,Fantasy Girl by .38 Special,1,0,3,0
2,Hold On Loosely,.38 Special,1981,Hold On Loosely by .38 Special,1,1,85,85
3,Rockin' Into the Night,.38 Special,1980,Rockin' Into the Night by .38 Special,1,1,18,18
4,Art For Arts Sake,10cc,1975,Art For Arts Sake by 10cc,1,1,1,1
...,...,...,...,...,...,...,...,...
2225,She Loves My Automobile,ZZ Top,NaN,She Loves My Automobile by ZZ Top,1,0,1,0
2226,Tube Snake Boogie,ZZ Top,1981,Tube Snake Boogie by ZZ Top,1,1,32,32
2227,Tush,ZZ Top,1975,Tush by ZZ Top,1,1,109,109
2228,TV Dinners,ZZ Top,1983,TV Dinners by ZZ Top,1,1,1,1
2229,WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO,ZZ Top,1973,WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO by...,1,1,2,2

In [6]:
# Look at the information regarding its columns.
rock.columns

Index(['Song Clean', 'ARTIST CLEAN', 'Release Year', 'COMBINED', 'First?',
       'Year?', 'PlayCount', 'F*G'],
      dtype='object')

### 2.  Clean up the column names.

Let's clean up the column names. There are two ways we can accomplish this:

#### 2.A Change the column names when you import the data using `pd.read_csv()`.

Notice that, when passing `names=[..A LIST OF STRING..]` with a number of columns that matches the number of strings in the passed list, you replace the column names.

NOTE: When you create custom column names, the first row of the `.csv` already represents a header. It is important to tell `pandas` to skip that row. The `skiprows=1` keyword argument to `read_csv()` will tell `pandas` to skip the first row.

In [6]:
# Change the column names when loading the '.csv':
col_names = ['song','artist','release','combined','is_first','is_year','playcount','f_g']
rock = pd.read_csv(rockfile,skiprows=1,names=col_names)
rock

,song,artist,release,combined,is_first,is_year,playcount,f_g
0,Caught Up in You,.38 Special,1982,Caught Up in You by .38 Special,1,1,82,82
1,Fantasy Girl,.38 Special,NaN,Fantasy Girl by .38 Special,1,0,3,0
2,Hold On Loosely,.38 Special,1981,Hold On Loosely by .38 Special,1,1,85,85
3,Rockin' Into the Night,.38 Special,1980,Rockin' Into the Night by .38 Special,1,1,18,18
4,Art For Arts Sake,10cc,1975,Art For Arts Sake by 10cc,1,1,1,1
...,...,...,...,...,...,...,...,...
2225,She Loves My Automobile,ZZ Top,NaN,She Loves My Automobile by ZZ Top,1,0,1,0
2226,Tube Snake Boogie,ZZ Top,1981,Tube Snake Boogie by ZZ Top,1,1,32,32
2227,Tush,ZZ Top,1975,Tush by ZZ Top,1,1,109,109
2228,TV Dinners,ZZ Top,1983,TV Dinners by ZZ Top,1,1,1,1
2229,WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO,ZZ Top,1973,WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO by...,1,1,2,2

#### 2.B Change column names using the `.rename()` function.

The `.rename()` function takes an argument, `columns=name_dict`, in which `name_dict` is a dictionary containing the original column names as keys and the new column names as values.

In [15]:
# Change the column names using the `.rename()` function.
rock.rename(columns={'Song Clean':'song', 'ARTIST CLEAN':'artist','Release Year':'release','COMBINED':'combined', 'First?':'is_first',
                    'Year?':'is_year','PlayCount':'playcount','F*G':'f_g'})

,song,artist,release,combined,is_first,is_year,playcount,f_g
0,Caught Up in You,.38 Special,1982,Caught Up in You by .38 Special,1,1,82,82
1,Fantasy Girl,.38 Special,NaN,Fantasy Girl by .38 Special,1,0,3,0
2,Hold On Loosely,.38 Special,1981,Hold On Loosely by .38 Special,1,1,85,85
3,Rockin' Into the Night,.38 Special,1980,Rockin' Into the Night by .38 Special,1,1,18,18
4,Art For Arts Sake,10cc,1975,Art For Arts Sake by 10cc,1,1,1,1
...,...,...,...,...,...,...,...,...
2225,She Loves My Automobile,ZZ Top,NaN,She Loves My Automobile by ZZ Top,1,0,1,0
2226,Tube Snake Boogie,ZZ Top,1981,Tube Snake Boogie by ZZ Top,1,1,32,32
2227,Tush,ZZ Top,1975,Tush by ZZ Top,1,1,109,109
2228,TV Dinners,ZZ Top,1983,TV Dinners by ZZ Top,1,1,1,1
2229,WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO,ZZ Top,1973,WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO by...,1,1,2,2

#### 2.C Reassigning the `.columns` attribute of a DataFrame.

You can also just reassign the `.columns` attribute to a list of strings containing the new column names. 

The only caveat with reassigning `.columns` is that you have to reassign all of the column names at once. You can't partially replace a value by working on `.columns` directly. You have to reassign `.columns` with a list of equal length.

In [7]:
# Replace the column names by reassigning the `.columns` attribute.
rock.columns = col_names
rock.columns

Index(['song', 'artist', 'release', 'combined', 'is_first', 'is_year',
       'playcount', 'f_g'],
      dtype='object')

### 3. Subsetting data where null values exist.

We have mixed `str` and `NaN` values in the `release` column. `NaN` stands for "not a number" and is the way `pandas` handles "nulls" or nonexistent data. We can use the `.isnull()` method of a Series to find null values.

Print the header of the data subset to where the `release` column is null values.

In [18]:
# Show records where df['release'] is null
rock.release.isnull().head()

0    False
1     True
2    False
3    False
4    False
Name: release, dtype: bool

### 4. Update slices of your DataFrame based on mask selection/slices.

In many scenarios, we want to upate values in our DataFrame according to criteria. Let's say we wanted to set all of the null values in `release` to 0.

With newer versions of `pandas`, in order to manipulate data in the original DataFrame, we have to use `.loc` while performing reassignment using a mask and an index.

For example, the following won't always work:
```python
df[row_mask]['column_name'] = new_value
```

The best way to accomplish the same task is:
```python
df.loc[row_mask, 'column_name'] = new_value
```

For multiple column assignment, you would use:
```python
df.loc[row_mask, ['col_1', 'col_2', 'col_3']] = new_value
```

#### 4.A Let's try it out. Make all of the null values in `release` 0.

In [8]:
# Replace release nulls with 0
rock.release.fillna(value=0, inplace=True)

#### 4.B Verify that `release` contains no null values.

In [26]:
# A:
rock.release.isnull().value_counts()

False    2230
Name: release, dtype: int64

### 5. Ensure that the data types of the columns make sense. 

Verifying column data types is a critical part of data munging. If columns have the wrong data type, then there is usually corrupted or incorrect data in some of the observations.

#### 5.A Look at the data types for the columns. Are any incorrect given what the data represents?

In [30]:
# A:
rock.dtypes

song         object
artist       object
release      object
combined     object
is_first      int64
is_year       int64
playcount     int64
f_g           int64
dtype: object

### 6. Investigate and clean up the `release` column.

The `release` column is a string data type when it should be an integer.

#### 6.A Figure out what value(s) are causing the `release` column to be encoded as a string instead of an integer.

In [35]:
# A:
rock.release.value_counts()
#rock.release.isnull().sum()

0                577
1973             104
1977              83
1975              83
1970              81
1971              75
1969              72
1980              70
1978              64
1979              63
1967              61
1981              61
1983              60
1976              56
1982              54
1984              51
1972              50
1974              48
1968              46
1985              39
1987              39
1986              37
1991              34
1989              32
1966              30
1988              29
1965              28
1994              25
1990              22
1993              19
1992              14
1964              14
1999              13
1995              10
1963               9
1997               9
1996               9
1998               6
2002               6
2005               5
2004               5
2012               5
2001               4
1962               3
2008               3
2000               3
2011               3
2003               3
2007               3
2013               2
2014               2
1071               1
1958               1
1961               1
SONGFACTS.COM      1
2006               1
1955               1
Name: release, dtype: int64

#### 6.B Look at the rows in which there is incorrect data in the `release` column.

In [36]:
# A:
rock[rock.release == 'SONGFACTS.COM']

,song,artist,release,combined,is_first,is_year,playcount,f_g
1504,Bullfrog Blues,Rory Gallagher,SONGFACTS.COM,Bullfrog Blues by Rory Gallagher,1,1,1,1

#### 6.C. Clean up the data. Normally we may replace the offending data with null np.nan values, however we previously converted all of the nan values in the release column to zeros so we might as well continue with the same practice. Replacing with 0 (or nan) will allow us to convert the column to numeric.

In [9]:
# A:
rock.release.loc[rock.release=='SONGFACTS.COM'] = 0
rock.release.value_counts()

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

0       578
1973    104
1975     83
1977     83
1970     81
1971     75
1969     72
1980     70
1978     64
1979     63
1967     61
1981     61
1983     60
1976     56
1982     54
1984     51
1972     50
1974     48
1968     46
1987     39
1985     39
1986     37
1991     34
1989     32
1966     30
1988     29
1965     28
1994     25
1990     22
1993     19
1964     14
1992     14
1999     13
1995     10
1996      9
1963      9
1997      9
1998      6
2002      6
2012      5
2004      5
2005      5
2001      4
2008      3
2007      3
1962      3
2003      3
2000      3
2011      3
2014      2
2013      2
2006      1
1961      1
1071      1
1955      1
1958      1
Name: release, dtype: int64

### 7. Get summary statistics for the `release` column using the `.describe()` function.

Now that the `release` column is finally a numeric data type, we can apply the `.describe()` function.  

#### 7.A Print out the summary stats for the `release` column. What is the earliest and latest release date?

In [10]:
# A:
print(rock.release.describe())
rock.release = pd.to_numeric(rock.release)
print(rock.release.max())
print(rock.release.min())

count     2230
unique      56
top          0
freq       578
Name: release, dtype: int64
2014
0

#### 7.B Based on the summary statistics, is there anything else wrong with the `release` column?

In [11]:
# A:
# assume 1071 is a typo and actually should be 1971
rock.release.loc[rock.release==1071] = 1971
rock.release.value_counts()

0       578
1973    104
1977     83
1975     83
1970     81
1971     76
1969     72
1980     70
1978     64
1979     63
1981     61
1967     61
1983     60
1976     56
1982     54
1984     51
1972     50
1974     48
1968     46
1985     39
1987     39
1986     37
1991     34
1989     32
1966     30
1988     29
1965     28
1994     25
1990     22
1993     19
1964     14
1992     14
1999     13
1995     10
1996      9
1997      9
1963      9
2002      6
1998      6
2012      5
2005      5
2004      5
2001      4
2000      3
2008      3
1962      3
2007      3
2003      3
2011      3
2013      2
2014      2
2006      1
1955      1
1961      1
1958      1
Name: release, dtype: int64

_Looking at the DataFrame that contains the year 1071, we can see that the year was probably corrupted and should be replaced with something else if possible._

### 8. Make changes and investigate using custom functions with `.apply()`.

Let's say we want to traverse every single row in our data set and apply a function to that row.

#### 8.A Write a function that will take a row of a DataFrame and print out the song, artist, and whether or not the release date is < 1970.

In [12]:
# A:
def print_row(row):
    is_pre_1970 = row['release'] < 1970
    print (row.song, row.artist, is_pre_1970)
print_row(rock.iloc[0])

Caught Up in You .38 Special False

#### 8.B Using the `.apply()` function, apply the function you wrote to the first four rows of the DataFrame.

You will need to tell the `apply` function to operate row by row. Setting the keyword argument as `axis=1` indicates that the function should be applied to each row individually.

In [13]:
# A:
rock.head(4).apply(print_row, axis=1)

Caught Up in You .38 Special False
Fantasy Girl .38 Special True
Hold On Loosely .38 Special False
Rockin' Into the Night .38 Special False

0    None
1    None
2    None
3    None
dtype: object

You'll notice that there will be a final output Series of `None` values. The `.apply()` function, if a return value is not specified, will return a Series of `None` values (similar to how the default return for Python functions is `None` when a return statement is not specified).

### 9. Write a function that converts cells in a DataFrame to float and otherwise replaces them with `np.nan`.

If applied to our data, it would keep only the numeric information and otherwise input null values.

Recall that the try-except syntax in Python is a great way to try something and take another action if the initial step fails:

```python
try:
    Perform some action.
except:
   Perform some other action if the first failed with an error.
```

#### 9.A Write the function that takes a column and converts all of its values to float if possible and `np.nan` otherwise. The return value should be the converted Series.

In [27]:
# A:
def to_float(column):
    for i in column.index:
        try:
            column.iloc[i] = float(column[i])
        except:
            column.iloc[i] = np.nan
    return column

#### 9.B Try your function out on the rock song data and ensure the output is what you expected.

In [28]:
# A:
to_float(rock.song)

0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
       ...
2225    NaN
2226    NaN
2227    NaN
2228    NaN
2229    NaN
Name: song, Length: 2230, dtype: object

#### 9.C Describe the new float-only DataFrame.

In [29]:
# A:
rock.describe()

           release  is_first      is_year    playcount          f_g
count  2230.000000    2230.0  2230.000000  2230.000000  2230.000000
mean   1465.734978       1.0     0.741256    16.872646    15.048430
std     867.221986       0.0     0.438043    25.302972    25.288366
min       0.000000       1.0     0.000000     0.000000     0.000000
25%       0.000000       1.0     0.000000     1.000000     0.000000
50%    1973.000000       1.0     1.000000     4.000000     3.000000
75%    1981.000000       1.0     1.000000    21.000000    18.000000
max    2014.000000       1.0     1.000000   142.000000   142.000000